# /usr/bin/env python
# _*_ coding:utf-8 _*_
__author__ = "Elijah"
__date__ = "2017/6/25 0:06"

'''问题：当一个全局变量作为参数传到函数中，函数对其进行修改之后，函数本身没有返回值，之后再将这个全局变量作为另一个函数的参数
传到另一个函数中，那么此时这个全局变量是不是被第一个函数修改过后的值？
例如：
global_var = 1
def f1(var):
    var = var + 1
def f2(var):
    var = var + 5
f1(global_var)
f2(global_var)
print(global_var)
'''
'''
user_info.txt
用户名、密码、余额、额度、欠款

yang_bill.txt 一人一个账单明细
日期、存款、取款、余额
'''
'''
账单怎么出？

'''

d = {'Alex': ['456', '2017-06-10', '54321', '2500', '3000', '20000'],
     'yang': ['123', '2017-05-10', '12345', '1000', '1500', '5000']}
# l = ['yang', 'gang', 'a', 'b', 'c']


# x=123
# def f1():
#     x=1
#     def f2():
#         print(x)
#     return f2
# f=f1()
# f()

# print(d['yang'][2])

dict = {1: ['456', '2017-06-10', '54321', '2500', '3000', '20000'],
        2: ['123', '2017-05-10', '12345', '1000', '1500', '5000'],
        3: ['456', '2017-06-10', '54321', '2500', '3000', '20000'],
        4: ['456', '2017-06-10', '54321', '2500', '3000', '20000'], }

# #总结！时间http://www.cnblogs.com/zhongtang/p/5507035.html
# a = read_ubill('root')
# n = time.strftime('%Y-%m-%d', time.localtime())
# date_a = time.strptime(a[0], '%Y-%m-%d')
# if a[0] < n:
#     print('对了！')
# else:
#     print('不对！')

# print(datetime.date.today())


items = {('root3', ['123', '5000', '10000', '0']), ('root4', ['123', '5000', '10000', '0']),
         ('Alex', ['456', '54321', '20000', '0']), ('root1', ['123', '5013', '10000', '0']),
         ('a', ['123', '1000', '1000', '0']), ('root2', ['123', '5000', '10000', '0']),
         ('yang', ['123', '12345', '5000', '0']), ('root', ['123', '5000', '10000', '0'])}

with open(user_info, mode='r', encoding='utf-8') as f:
        for k, v in info_dict.items():
            f.write(k + ',' + v[0] + ',' + v[1] + ',' + v[2] + ',' + v[3])
